Config/InformationRegisters/ГрафикиРаботыГруппДетскогоУчреждения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыГруппДетскогоУчреждения</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаДетскогоУчреждения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДетскогоУчреждения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ГрафикиРаботыГруппДетскогоУчреждения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрСведений.ГрафикиРаботыГруппДетскогоУчреждения";
	
	// Заполнение регистра ГрафикиРаботыГруппДетскогоУчреждения.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГруппыДетскогоУчреждения.Ссылка КАК ГруппаДетскогоУчреждения
	|ИЗ
	|	Справочник.ГруппыДетскогоУчреждения КАК ГруппыДетскогоУчреждения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикиРаботыГруппДетскогоУчреждения КАК ГрафикиРаботыГруппДетскогоУчреждения
	|		ПО (ГрафикиРаботыГруппДетскогоУчреждения.ГруппаДетскогоУчреждения = ГруппыДетскогоУчреждения.Ссылка)
	|ГДЕ
	|	ГрафикиРаботыГруппДетскогоУчреждения.ГруппаДетскогоУчреждения ЕСТЬ NULL
	|	И ГруппыДетскогоУчреждения.УдалитьГрафикРаботы <> ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ЭлементыКОбработке = Новый ТаблицаЗначений;
	ЭлементыКОбработке.Колонки.Добавить("ГруппаДетскогоУчреждения", Новый ОписаниеТипов("СправочникСсылка.ГруппыДетскогоУчреждения"));
	
	КоличествоЭлементов = 0;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭлементыКОбработке.Добавить(), Выборка);
		
		КоличествоЭлементов = КоличествоЭлементов + 1;
		Если КоличествоЭлементов = 1000 Тогда
			ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ЭлементыКОбработке, ДополнительныеПараметры);
			КоличествоЭлементов = 0;
			ЭлементыКОбработке.Очистить();
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоЭлементов > 0 Тогда
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, ЭлементыКОбработке, ДополнительныеПараметры);
	КонецЕсли
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрСведений.ГрафикиРаботыГруппДетскогоУчреждения";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	Параметры.ОбработкаЗавершена = Ложь;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	
	ЭлементыКОбработке = Новый ТаблицаЗначений;
	ЭлементыКОбработке.Колонки.Добавить("ГруппаДетскогоУчреждения", Новый ОписаниеТипов("СправочникСсылка.ГруппыДетскогоУчреждения"));
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка
			ПредставлениеОбъекта = Строка(Выборка.ГруппаДетскогоУчреждения);
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ГрафикиРаботыГруппДетскогоУчреждения");
			ЭлементБлокировки.УстановитьЗначение("ГруппаДетскогоУчреждения", Выборка.ГруппаДетскогоУчреждения);
			Блокировка.Заблокировать();			
			
			Объект = Выборка.ГруппаДетскогоУчреждения.ПолучитьОбъект(); // СправочникОбъект.ГруппыДетскогоУчреждения
			Если Объект = Неопределено Или НЕ ЗначениеЗаполнено(Объект.УдалитьГрафикРаботы) Тогда
				ЗаполнитьЗначенияСвойств(ЭлементыКОбработке.Добавить(), Выборка);
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ЭлементыКОбработке, ДополнительныеПараметры);
				ЭлементыКОбработке.Очистить();
			Иначе
				НаборЗаписей = РегистрыСведений.ГрафикиРаботыГруппДетскогоУчреждения.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ГруппаДетскогоУчреждения.Установить(Выборка.ГруппаДетскогоУчреждения);
				
				Запись = НаборЗаписей.Добавить();
				Запись.Период = '19800101';
				Запись.ГруппаДетскогоУчреждения = Объект.Ссылка;
				Запись.ГрафикРаботы = Объект.УдалитьГрафикРаботы;
				
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей,Истина,Ложь,Ложь);
			
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось перенести график группы: %Элемент% в регистр сведений по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Элемент%", ПредставлениеОбъекта);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(
				ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Выборка.Ссылка.Метаданные(),
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
